'''
RNN层（循环网络层）
  逐步处理词向量，生成每个时间步的 隐藏状态
全连接层（输出映射）
   通过线性变换将隐藏状态映射到输出，通常是1个词汇表中词的概率分布
'''
import torch
import torch.nn as nn

#1创建循环网络层
#参一：词向量的维度，就像电影里每一帧画面有128个细节（比如颜色，动作，表情等），RNN（你的大脑）,每次看到的是这128个细节
#参二：隐藏状态向量维度，你的大脑能记住的剧情信息量有多大。值越大，能存储的剧情记忆就越多
#参三：隐藏层数量，默认是1，你的大脑只有1层处理它，如果是2，说明2层大脑接力理解剧情，第1层处理，第2层加工
rnn=nn.RNN(input_size=128,hidden_size=256,num_layers=1)

#定义变量，表示输入的x
#参一：每个句子的词的个数（长度）
#参二：句子的个数
#参三：词向量的维度
x=torch.randn(size=(5,32,128))

#定义变量，记录：上一个时刻的隐藏状态
#参一：隐藏层的层数，
#参二：句子的数量
#隐藏状态的向量维度
h0=torch.randn(size=(1,32,256))

#调用RNN处理，获取到当前时刻的预测值 和当前隐藏状态
#output:每个时间步的输出，包含了所有时间步的隐藏状态
#h1：最后一个时间步的隐藏状态
output,h1=rnn(x,h0)

print(f'output:{output.shape}')
print(f'h1:{h1.shape}')

