#简单行列索引 列表索引 范围索引 布尔索引 多维索引
import torch
torch.manual_seed(24)
t1=torch.randint(1,10,(5,5))
print(f't1:{t1}')
print('-'*30)

#简单行列索引  格式：张量对象【行，列】
print(t1[1])#第二行的数据
print(t1[1,:])#答案同上，：表示所有列
print(t1[:,2])#第三列所有行
print(t1[1,2])
print('-'*30)

#列表索引前面表示行，后面表示列
print(t1[[0,1],[1,2]])#返回 第一行第二列 和 第二行第三列 两个位置的元素
print(t1[[1,3],[2,4]])#返回 第二行第三列 和 第四行第五列 两个位置的元素
print(t1[[[0],[1]],[1,2]])#第一行所有元素二三列 第二行所有元素二三列
print('-'*30)

#范围索引
print(t1[:3,:2])#前3行 前2列
print(t1[1:,:2])#从第二行到最后一行 前两列的数据
print(t1[1::2,0::2])#所有的（索引）是奇数行和偶数列的数据，步长为2
print('-'*30)

#布尔索引
print(t1[t1[:,2]>5])#第三列 大于5的行数据
print(t1[1,t1[1,:]>5])#第二行大于5的列数据
print('-'*30)

#多维索引(0轴2两个元素，1轴3个元素，2轴4个元素)
t2=torch.randint(1,10,(2,3,4))#2个3行4列的矩阵
print(f't2:{t2}')
#print(t2[0,:,:])#获取0轴上的第一个数据
#print(t2[:,0,:])#获取1轴上的第一个数据
print(t2[:,:,0])#获取2轴上的第一个数据
